Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: མིག་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར། འདི་ལྟ་སྟེ། མིག་འདི་ནི་མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ། །
en: “Since the eyes are non-apprehensible, it follows that so-called ‘eyes’ are nothing but a mere name or conventional term.

source: དེ་བཞིན་དུ་ཡིད་ཀྱི་བར་དུ་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་ལུས་དང་། ཡིད་ཅེས་བྱ་བ་འདི་ནི་མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ། །
en: Similarly, since [the other sense organs], up to and including the mental faculty, are non-apprehensible, it follows that so-called ‘ears, nose, tongue, body and mental faculty’ are nothing but mere names or conventional terms.

source: དེ་བཞིན་དུ་གཟུགས་རྣམས་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་འདི་ལྟ་སྟེ། གཟུགས་རྣམས་ཞེས་བྱ་བ་འདི་དག་ནི་མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ། །དེ་བཞིན་དུ་སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་རྣམས་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་འདི་ལྟ་སྟེ།
en: Similarly, since sights are non-apprehensible, it follows that so-called ‘sights’ are nothing but a mere name or conventional term.

source: སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་རྣམས་ཞེས་བྱ་བ་འདི་དག་ནི་མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ། །
en: Similarly, since sounds, odors, tastes, tangibles, and mental phenomena are non-apprehensible, it follows that so-called ‘sounds, odors, tastes, tangibles, and mental phenomena’ are nothing but mere names or conventional terms.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཞེས་བྱ་བ་འདི་དག་ནི་མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། ལམ་གྱི་བར་དུ་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: “Since the applications of mindfulness are non-apprehensible, it follows that the so-called ‘four applications of mindfulness’ are nothing but mere names or conventional terms, and the same goes for [all other causal attributes], up to and including the [noble eightfold] path.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་དེ་བཞིན་ནོ། །
en: Since they are all non-apprehensible, it follows that the same goes for the so-called ‘[four] correct exertions, [four] supports for miraculous ability, five faculties, five powers, seven branches of enlightenment, and the noble eightfold path.’

source: འདི་ལྟ་སྟེ། ནང་སྟོང་པ་ཉིད་ནས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དེ་ནི་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར། མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ། །
en: “In the same way, since the emptiness of internal phenomena and the other aspects of emptiness, up to and including the emptiness of the essential nature of non-entities, are non-apprehensible, they are nothing but mere names or conventional terms.

source: འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དེ་དག་ནི་མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་པ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་འདི་ལྟ་སྟེ།
en: Likewise, the so-called ‘ten powers of the tathāgatas’ are nothing but mere names or conventional terms, and the same goes for [the other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བའི་བར་དེ་དག་ནི་མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ། །ཡང་དག་པའི་མཐའི་བར་དུ་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་འདི་ལྟ་སྟེ།
en: Since these are all non-apprehensible, it follows that all [fruitional attributes], up to and including the so-called ‘[eighteen] distinct qualities of the buddhas,’ are nothing but mere names or conventional terms.

source: དེ་བཞིན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་ཞེས་བྱ་བ་དེ་ནི་མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ། །བྱང་ཆུབ་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་འདི་ལྟ་སྟེ།
en: “Since [unconditioned phenomena], up to an including the finality of existence, are non-apprehensible, it follows that the so-called ‘real nature, expanse of reality, maturity, and finality of existence’ are all nothing but mere names or conventional terms.

source: བྱང་ཆུབ་ཅེས་བྱ་བ་འདི་ནི་མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ། །འདི་ལྟ་སྟེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱ་བ་འདི་ནི་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར། མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ་སྙམ་པ་སྟེ།
en: Since enlightenment is non-apprehensible, it follows that this so-called ‘enlightenment’ is nothing but a mere name or conventional term; and in the same way, since a ‘genuinely perfect buddha’ is non-apprehensible, it is nothing but a mere name or conventional term.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་སྟེ། ཉམས་པ་མེད་པའི་མངོན་པར་ཤེས་པ་ལྔ་ཡོངས་སུ་རྫོགས་པར་བྱེད། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་དག་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་ཞིང་།
en: “Moreover, Śāradvatī­putra, great bodhisattva beings, from the time when they first begin to set their mind on enlightenment, perfect the five extrasensory powers which are without degeneration, and they bring sentient beings to maturity.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བཀུར་སྟི་བྱེད། བླ་མར་བྱེད། རི་མོར་བྱེད། མཆོད་པ་བྱེད་ཅིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལས་ཡང་དང་ཡང་དུ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་རབ་མཆོག་གི་ཐེག་པ་འདི་ཉིད་ཀྱི་ཆོས་ཀྱང་ཉན་ཏོ། །
en: They also refine the buddhafields, they pass from one buddhafield to another buddha field, they honor, venerate, respect, and make offerings to the lord buddhas, and they repeatedly listen to the sacred doctrines of this most supreme vehicle of the bodhisattvas, in the presence of those lord buddhas.

source: ཐེག་པ་འདི་ལ་ཞོན་ཏེ། སེམས་ཅན་ལ་ཕན་གདགས་པའི་ཕྱིར་དང་། སངས་རྒྱས་ལ་བལྟ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་ཡང་དེ་ཕྱིར་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་འདུ་ཤེས་ཀྱང་མི་འབྱུང་། སེམས་ཅན་གྱི་འདུ་ཤེས་དང་། སངས་རྒྱས་ཀྱི་འདུ་ཤེས་ཀྱང་མི་འབྱུང་ངོ་། །
en: Mounted on this vehicle, they proceed to the buddhafields in order to benefit sentient beings and in order to behold the buddhas, but, in addition, they are without the notion of a buddhafield, they are without the notion of sentient beings, and they are even without the notion of a buddha.

source: ཡང་དེ་གཉིས་སུ་མེད་པའི་ས་ལ་གནས་ནས། ལུས་ཇི་སྙེད་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱ་བའི་སྐལ་བ་དང་ལྡན་པ་དེ་སྙེད་ཀྱི་ལུས་ཡོངས་སུ་འཛིན་ཏོ། །
en: Indeed, abiding on the level of non-duality, they acquire as many corporeal forms as will facilitate their appropriate acts for the welfare of sentient beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ་ནམ་ཡང་ཐེག་པ་དེ་དང་བྲལ་བར་མི་འགྱུར་རོ། །དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྗེས་སུ་ཐོབ་ནས་དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ།
en: Until they attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment, they will never be separated from this [Great] Vehicle.

source: ལྷའམ། བདུད་དམ། ཚངས་པའམ། གཞན་སུས་ཀྱང་མ་བསྐོར་བའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་འགྱུར་རོ། །
en: “Having obtained omniscience, they continue to turn the wheel of the sacred doctrine, which cannot be turned by virtuous ascetics, brāhmin priests, gods, demonic forces, Brahmā deities, or anyone else.

source: ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་འཚོ་ཞིང་བཞུགས་པ་དང་། དེ་བཞིན་དུ་ཕྱོགས་མཚམས་ཀྱི་བར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་འཚོ་ཞིང་བཞུགས་པ་དེ་དག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆེ་གེ་མོ་ཞིག་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞོན་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྗེས་སུ་ཐོབ་སྟེ།
en: Whichever lord buddhas are alive and reside in the world systems of the eastern direction, numerous as the sands of the River Ganges, and whichever buddhas are alive and reside similarly in the world systems of the other directions, up to and including the intermediate directions, numerous as the sands of the River Ganges, they will all offer praise and chant their eulogies, saying, ‘Such and such a great bodhisattva being, in such and such a world system, has ridden the Great Vehicle, and subsequently obtained the understanding of all the aspects of omniscience.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྗེས་སུ་ཐོབ་ནས། དེ་ལྟ་ན་གཞན་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་ནས་གཞན་སུས་ཀྱང་མ་བསྐོར་བའི་ཆོས་ཀྱི་འཁོར་ལོ་འཇིག་རྟེན་དུ་བསྐོར་རོ་ཞེས་དེའི་བསྔགས་པ་རྗོད་ཅིང་སྙན་པ་སྒྲོགས་ལ་དབྱངས་བརྗོད་པར་མཛད་དེ།
en: Having obtained the understanding of all the aspects of omniscience, that one turns in the world the wheel of the sacred doctrine, which cannot be turned by virtuous ascetics, brāhmin priests, or anyone else!’

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: “Moreover, Śāradvatī­putra, the Great Vehicle of great bodhisattva beings entails the six transcendent perfections.

source: དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: If you ask what these six are, they comprise the transcendent perfection of generosity, the transcendent perfection of ethical discipline, the transcendent perfection of tolerance, the transcendent perfection of perseverance, the transcendent perfection of meditative concentration, and the transcendent perfection of wisdom.

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། དྲུག་པོ་དེ་དག་གོ། །
en: These are the six transcendent perfections.

source: དེ་ལ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་འདི་ལྟ་སྟེ། ནང་ངམ་ཕྱིའི་དངོས་པོ་དག་གི་སྦྱིན་པ་དེ་འདོད་པ་རྣམས་ལ་སྦྱིན་པར་བྱེད་ཅིང་བྱིན་ནས་ཀྱང་སྦྱིན་པ་དེ་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་དེ་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “If, among them, you ask what is the transcendent perfection of generosity—Śāradvatī­putra, when great bodhisattva beings who have cultivated the mind endowed with omniscience give inner or outer objects to those who desire them, and having done so, then dedicate the merit of these gifts for the sake of unsurpassed, genuinely perfect enlightenment, making common cause with all sentient beings, that, Śāradvatī­putra, is the transcendent perfection of generosity, possessed by great bodhisattva beings.

source: དེ་ལ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་བདག་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ནས་ལེགས་པར་སྤྱོད་ལ། གཞན་དག་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ། རབ་ཏུ་འགོད་ལ་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱེད་པ་འདི་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནག་ནོག་མེད་པའོ། །
en: “Then, if you ask what is the transcendent perfection of ethical discipline—Śāradvatī­putra, when great bodhisattva beings who have cultivated the mind endowed with omniscience adopt and practice correctly the path of the ten virtuous actions and then also correctly introduce, secure, and establish others on the path of virtuous actions, and do so without apprehending anything, this, Śāradvatī­putra, is the unblemished transcendent perfection of ethical discipline, possessed by great bodhisattva beings.”

source: དེ་ལ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདག་ཀྱང་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ལ། གཞན་དག་ཀྱང་བཟོད་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ་རབ་ཏུ་འགོད་ལ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱེད་པ་དེ་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །དེ་ལ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན།
en: “If you ask what is the transcendent perfection of tolerance—Śāradvatī­putra, when great bodhisattva beings [who have cultivated the mind endowed with omniscience] themselves possess the excellent endowment of tolerance, and then also correctly introduce, secure, and establish others in tolerance, and they do so without apprehending anything, this, Śāradvatī­putra, is the transcendent perfection of tolerance, possessed by great bodhisattva beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། ཕ་རོལ་ཕྱིན་པ་དྲུག་ལ་བརྩོན་པ་མི་གཏོང་བ་ཡིན། སེམས་ཅན་རྣམས་ཀྱང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ་རབ་ཏུ་འགོད་ལ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱེད་པ་དེ་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “If you ask what is the transcendent perfection of perseverance—Śāradvatī­putra, when great bodhisattva beings who have cultivated the mind endowed with omniscience are indefatigable with respect to the six transcendent perfections, and also correctly introduce, secure, and establish sentient beings in the six transcendent perfections, and do so without apprehending anything, this, Śāradvatī­putra, is the transcendent perfection of perseverance, possessed by great bodhisattva beings.

source: དེ་ལ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། བདག་ཀྱང་ཐབས་ལ་མཁས་པས་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དག་ལ་སྙོམས་པར་འཇུག་ཅིང་། དེ་དག་གི་དབང་གིས་ཀྱང་མི་སྐྱེ་ལ། གཞན་དག་ཀྱང་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ་རབ་ཏུ་འགོད་ལ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱེད་པ་དེ་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “If you ask what is the transcendent perfection of meditative concentration—Śāradvatī­putra, when great bodhisattva beings who have cultivated the mind endowed with omniscience are themselves skillfully absorbed in the meditative concentrations, the immeasurable aspirations, and the formless absorptions, and on that account are no longer subject to rebirth, while they also correctly introduce, secure, and establish others in these meditative concentrations, immeasurable aspirations, and formless absorptions, doing so without apprehending anything, this, Śāradvatī­putra, is the transcendent perfection of meditative concentration, possessed by great bodhisattva beings.

source: དེ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་ཅིང་། ཆོས་ཐམས་ཅད་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་ལ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱེད་དེ། ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་ནས་ཀྱང་གཞན་དག་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ་རབ་ཏུ་འགོད་ལ།
en: “If you ask what is the transcendent perfection of wisdom—Śāradvatī­putra, when great bodhisattva beings who have cultivated the mind endowed with omniscience definitively discern the nature of all things, and are without fixation on all things, without apprehending anything, and having become unfixated on all things, then also correctly introduce, secure, and establish others in that definitive discernment of the nature of all things, and they do so without apprehending anything, this, Śāradvatī­putra, is the transcendent perfection of wisdom, possessed by great bodhisattva beings.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱེད་པ་དེ་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Śāradvatī­putra!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཇིག་རྟེན་པ་ལགས་སམ། འོན་ཏེ་འཇིག་རྟེན་ལས་འདས་པ་ལགས།
en: Is the transcendent perfection of generosity mundane, or is it supramundane?

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་ཡང་དེ་ལྟ་ལགས་སམ།
en: Is this also the case with respect to the other transcendent perfections, up to and including the transcendent perfection of wisdom? Reverend Lord!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཇིག་རྟེན་པ་ལགས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་ཡང་དེ་ལྟ་ལགས་ན་ནི། བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་འཇིག་རྟེན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ལགས།
en: If the transcendent perfection of generosity were mundane, and that were also the case with respect to the other transcendent perfections, up to and including the transcendent perfection of wisdom, then, Reverend Lord, in what way could one perfect the transcendent perfection of mundane generosity, and likewise, the other transcendent perfections, up to and including the transcendent perfection of wisdom?

source: འཇིག་རྟེན་པ་ནི་འདུས་བྱས་ལགས་ལ། འདུས་བྱས་གང་ལགས་པ་དེ་ནི་མི་རྟག་པ་ལགས་ན། མི་རྟག་པ་གང་ལགས་པ་དེ་ཇི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ལགས།
en: Mundane things are conditioned, and since anything that is conditioned is impermanent, how could something that is impermanent be perfected as a transcendent perfection?

source: ཇི་སྟེ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཇིག་རྟེན་ལས་འདས་པ་ལགས་ཤིང་།
en: Also, how could the transcendent perfection of generosity be supramundane?

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་ཡང་དེ་ལྟ་ལགས་ན་ནི། །དེ་ནི་བྱེད་པ་མ་མཆིས་པ་ལགས་ལ།
en: If [the transcendent perfections], up to and including the transcendent perfection of wisdom, were so, they would not be created.

source: བྱེད་པ་མ་མཆིས་པ་གང་ལགས་པ་དེ་ཇི་ལྟར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: How could something that is not created be perfected?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་འཇིག་རྟེན་པ་ཡང་ཡོད། འཇིག་རྟེན་ལས་འདས་པ་ཡང་ཡོད།
en: The Blessed One then addressed the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, the transcendent perfection of generosity is both mundane and supramundane.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་འཇིག་རྟེན་པ་ཡང་ཡོད།
en: The transcendent perfection of ethical discipline, the transcendent perfection of tolerance, the transcendent perfection of perseverance, the transcendent perfection of meditative concentration, and the transcendent perfection of wisdom also are both mundane and supramundane.”

source: འཇིག་རྟེན་ལས་འདས་པ་ཡང་ཡོད་དོ། །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཇིག་རྟེན་པ་ནི་གང་ལགས།
en: Śāradvatī­putra then asked, “What is the mundane transcendent perfection of generosity?

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཇིག་རྟེན་ལས་འདས་པ་ནི་གང་ལགས། བཀའ་སྩལ་པ།
en: What is the supramundane transcendent perfection of generosity?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་ཕོད་པ་སྦྱིན་བདག་ཏུ་གྱུར་པ་དེ་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། བཀྲེན་པ་དང་། འདྲོན་པ་དང་། སྡུག་འཕོངས་པ་དང་། སློང་བ་རྣམས་ལ་ཟས་འདོད་པ་དག་ལ་ཟས་སྦྱིན་པར་བྱེད། སྐོམ་འདོད་པ་དག་ལ་སྐོམ་སྦྱིན་པར་བྱེད་པ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། གོས་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་།
en: “Śāradvatī­putra, those great bodhisattva beings who have become liberal donors bequeath food to virtuous ascetics, brāhmins, the destitute, wandering mendicants, forest-dwelling anchorites, and to beggars who are in need of food.

source: མལ་ཆ་དང་། སྟན་དང་། ཁྱིམ་འདོད་པའི་བར་དག་ལ་སྦྱིན་པར་བྱེད་པ་དང་། གནས་འདོད་པ་དག་ལ་གནས་སྦྱིན་པར་བྱེད་ཅིང་། སྨན་འདོད་པ་རྣམས་ལ་སྨན། ཡོ་བྱད་འདོད་པ་རྣམས་ལ་ཡོ་བྱད་སྦྱིན་པར་བྱེད་པ་དང་། དེ་བཞིན་དུ་སློང་བ་རྣམས་ལ་མིའི་ཡོ་བྱད་གང་ཡང་རུང་བ་དག་སྦྱིན་པར་བྱེད་པ་དང་། དེ་བཞིན་དུ་བུ་ཕོ་སྦྱིན་པར་བྱེད་པ་དང་།
en: They offer drink to those in need of drink, and in the same vein, they donate clothing, incense, garlands, unguents, bedding, mats, and homes to those who are in need of them.

source: བུ་མོ་སྦྱིན་པར་བྱེད་པ་དང་། ཆུང་མ་དང་། སླས་ཀྱི་འཁོར་དག་སྦྱིན་པར་བྱེད་པ་དང་། དེ་བཞིན་དུ་མགོ་དང་། མིག་དག་དང་། རྣ་བ་དང་། སྣ་དང་། རྐང་པ་དང་། ལག་པ་དང་།
en: They donate lodgings to those who are in need of lodgings, they offer medicines to those in need of medicine, they offer provisions to those in need of provisions; and similarly, they offer appropriate human resources to beggars, and likewise, they offer their sons, they offer their daughters, they offer their wives and courtesans; and similarly, they offer their heads, eyes, ears, nose, marrow, hands, limbs, and appendages.

source: ཡན་ལག་དང་། ཉིང་ལག་དག་སྦྱིན་པར་བྱེད་ཅིང་། དེ་དག་ཀྱང་དངོས་པོའི་བདག་ཉིད་དུ་གནས་ནས་ཡོངས་སུ་གཏོང་བར་བྱེད་ལ། དེ་འདི་སྙམ་དུ་ཡང་སེམས་ཏེ། བདག་ནི་སྦྱིན་པར་བྱེད་པའོ། །
en: In doing so, they practice liberality while adhering to the ownership of property, thinking, ‘I am giving.

source: འདི་དག་ནི་ལེན་པར་བྱེད་པ་དག་གོ། །
en: They are receiving.

source: ཀྱེ་བདག་ནི་སེར་སྣ་མེད་པའོ། །
en: O! I am without miserliness.

source: བདག་ནི་སྦྱིན་བདག་ཡིན་ནོ། །
en: I am a donor.

source: བདག་ནི་སློངས་མོ་སྟེར་བའོ། །
en: I give alms.

source: ཀྱེ་བདག་ནི་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའོ། །
en: O! I give everything.

source: བདག་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བཀུར་སྟི་བྱེད་པའོ། །
en: I respect the lord buddhas.

source: བདག་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: I practice the transcendent perfection of generosity.

source: སྦྱིན་པ་དེ་བྱིན་ནས་ཀྱང་མི་དམིགས་པའི་ཚུལ་གྱིས་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བར་བྱེད་ཅིང་།
en: I, having given this gift, dedicate it for the sake of unsurpassed, genuinely perfect enlightenment, making common cause with all sentient beings, and without apprehending anything!

source: བདག་གི་སྦྱིན་པ་འདིས་སེམས་ཅན་ཐམས་ཅད་ཚེ་འདི་ཉིད་ལ་བདེ་བར་གྱུར་ཅིག །
en: Through this, my gift, may all sentient beings attain happiness in this lifetime!

source: ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཅིག་སྙམ་མོ། །
en: May they attain final nirvāṇa in the expanse of reality that is beyond sorrow, and where there is no residue of the psycho-physical aggregates!’

source: དེ་ནི་ཆགས་པ་གསུམ་ལ་ཆགས་ཤིང་སྦྱིན་པ་དེ་སྦྱིན་པར་བྱེད་དེ།
en: However, in giving their gifts they are tied by three fetters.

source: གསུམ་པོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What, you may ask, are the three?

source: བདག་ཏུ་འདུ་ཤེས་པ་དང་། གཞན་དུ་འདུ་ཤེས་པ་དང་། སྦྱིན་པར་འདུ་ཤེས་པ་སྟེ།
en: They comprise the notion of self, the notion of others, and the notion of the act of giving.

source: ཆགས་པ་གསུམ་པོ་དེ་དག་ལ་ཆགས་ནས། སྦྱིན་པ་དེ་སྦྱིན་པར་བྱེད་པ་དེ་ནི། ཤ་ར་དྭ་ཏིའི་བུ་འཇིག་རྟེན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ། །
en: This act of giving gifts, when tied by these three fetters, Śāradvatī­putra, is called the transcendent perfection of mundane generosity.

source: ཅིའི་ཕྱིར་འཇིག་རྟེན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་ཞེ་ན། འདི་ལྟར་འཇིག་རྟེན་དང་ལྷན་ཅིག་ཏུ་སྤྱོད་ཅིང་འཇིག་རྟེན་ལས་མི་གཡོ་ལ་ཡང་དག་པར་མི་འདའ་སྟེ།
en: If you ask why it is called the transcendent perfection of mundane generosity, it is because those who practice in such mundane ways do not move beyond and transcend the mundane.

source: རྒྱུ་དེས་ན་འཇིག་རྟེན་པ་ཞེས་བྱའོ། །
en: For that reason, it is designated as ‘mundane.’

source: དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What, you may ask, is the supramundane transcendent perfection of generosity?

source: འཁོར་གསུམ་ཡོངས་སུ་དག་པ་སྟེ།
en: It is the purity of the three spheres [of subject, object, and their interaction].

source: དེ་ལ་ཀྱེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོ་བའི་སེམས་ཀྱིས་སྦྱིན་པ་སྦྱིན་པ་ཡང་མི་དམིགས།
en: In this context, the mind that is preceded by the great compassion of great bodhisattva beings does not apprehend the dispensing of gifts.

source: སྦྱིན་པ་པོ་ཡང་མི་དམིགས། ལེན་པ་པོ་ཡང་མི་དམིགས།
en: It does not apprehend the giver, nor does it apprehend the recipient.

source: སྦྱིན་པ་ཡང་མ་ཡིན་ལ། སྦྱིན་པ་དེའི་རྣམ་པར་སྨིན་པ་ལ་ཡང་མངོན་པར་དགའ་བ་མེད་པ་དེ་ནི། ཤ་ར་དྭ་ཏིའི་བུ་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ཞེས་བྱའོ། །
en: This absence of giving and the absence of rejoicing in the ripening impact of giving, Śāradvatī­putra, is called the purity of the three spheres [of subject, object, and their interaction].
